app/views/main/_places_categories.html.erb

SELECT  "images".* FROM "images" WHERE "images"."place_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["place_id", 1]]
SELECT  1 AS one FROM "images" WHERE "images"."place_id" = ? LIMIT 1  [["place_id", 1]]
---
			<div class="place_main_image_thumb">
				<% if place.images.empty? %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 1]]
---
			Rating: <%= place.rating %> <br/>
			(<%= place.rating %>, <%= place.reviews.count %> reviews) <br/>