app/views/main/index.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 1]]
---
	Rating: <%= place.rating %> <br/>
	(<%= place.rating %>, <%= place.reviews.count %> reviews)