app/views/main/show.html.erb

Rating: <%= @place.rating %> <br/>
(<%= @place.rating %>, <%= @place.reviews.count %> reviews)
<% if !@place.images.empty? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."place_id" = ?  [["place_id", 1]]
SELECT  "images".* FROM "images" WHERE "images"."place_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["place_id", 57]]
SELECT  1 AS one FROM "images" WHERE "images"."place_id" = ? LIMIT 1  [["place_id", 2]]