app/controllers/main_controller.rb

  def index
  	@categories = Category.all
  	@places = Place.paginate(:page => params[:page], :per_page => 20)
---
SELECT  "places".* FROM "places" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "places"