app/controllers/main_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "places".* FROM "places" WHERE "places"."approved" = ? LIMIT 20 OFFSET 0  [["approved", "t"]]
SELECT COUNT(*) FROM "places" WHERE "places"."approved" = ?  [["approved", "t"]]
---
  def index
  	@categories = Category.all
    @last_category = Category.last
  	@places = Place.where(approved: true).paginate(:page => params[:page], :per_page => 20)

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."category_id" = ? LIMIT 30 OFFSET 0  [["category_id", 1]]
SELECT COUNT(*) FROM "places" WHERE "places"."category_id" = ?  [["category_id", 1]]
---
  def selected_category
  	@places = Place.where(category_id: params[:id]).paginate(page:params[:page], :per_page => 20)