app/controllers/places_controller.rb

INSERT INTO "places" ("title", "description", "category_id", "user_id", "eula", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "images" ("picture_file_name", "picture_content_type", "picture_file_size", "picture_updated_at", "user_id", "place_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@place = Place.new(place_params)

  	if @place.save
      if params[:picture]
          @place.images.create(picture: params[:picture], user_id: current_user.id)