app/views/places/_place_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id, "Категория" %>
    <%= f.collection_select :category_id, Category.all, :id, :name, {:include_blank => 'выберите Категорию'}, required: true %><br />